anthropic.claude-code
dbaeumer.vscode-eslint
editorconfig.editorconfig
esbenp.prettier-vscode
foxundermoon.shell-format
github.copilot-chat
golang.go
ms-azuretools.vscode-containers
ms-kubernetes-tools.vscode-kubernetes-tools
ms-python.autopep8
ms-python.debugpy
ms-python.python
ms-python.vscode-pylance
ms-python.vscode-python-envs
ms-vscode-remote.remote-containers
openai.chatgpt
redhat.vscode-yaml
shd101wyy.markdown-preview-enhanced
sst-dev.opencode
timonwong.shellcheck
